_posts/2015-11-04-Clickable-telephone-numbers-in-mu4e-messages.html
---
title: Clickable telephone numbers in mu4e messages
date: 2015/11/04 12:45:12
updated: 2015/11/04 12:45:12
categories: emacs
tags: 
---


<p>
We recently updated our university phone system to a VoIP system that uses Cisco Jabber. I am excited about that because finally I can make phone calls from Emacs with a little applescript automation! So, spoiler alert, this post mostly only applies to Macs, unless you know how to automate a Jabber client to make calls. How to make the telephone numbers clickable is general though, and could be used to do other things as well.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">cisco-call</span> (phone-number)
  (<span style="color: #0000FF;">interactive</span> <span style="color: #008000;">"sPhone number: "</span>)
  (do-applescript
   (format <span style="color: #008000;">"tell application \"Cisco Jabber\"</span>
<span style="color: #008000;">        activate</span>
<span style="color: #008000;">        tell application \"System Events\" to keystroke \"n\" using {shift down, command down}</span>
<span style="color: #008000;">        tell application \"System Events\" to keystroke \"%s\"</span>
<span style="color: #008000;">        tell application \"System Events\" to key code 36 #return</span>
<span style="color: #008000;">end tell"</span> phone-number)))
</pre>
</div>

<pre class="example">
cisco-call
</pre>

<p>
I would like to go a step further, and make clickable phone numbers in my Emacs buffers. Let's take a look at some options.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> org-mode phone link</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a no-brainer approach. We can define an org-mode link that runs the cisco-call function.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-add-link-type
 <span style="color: #008000;">"phone"</span>
 (<span style="color: #0000FF;">lambda</span> (phone-number)
   (cisco-call phone-number)))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">lambda</td>
<td class="left">(phone-number)</td>
<td class="left">(cisco-call phone-number)</td>
</tr>
</tbody>
</table>

<p>
This makes simple link that just calls the number in the path of the link.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Clickable text with button-lock</h2>
<div class="outline-text-2" id="text-2">
<p>
I have used the button-lock package very often to make clickable text. Here we use it to highlight phone numbers matching a regular expression that seems to match most US numbers. This seems to work great in org-mode buffers.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">rx</span>)

(<span style="color: #0000FF;">defvar</span> <span style="color: #BA36A5;">highlight-phone-numbers</span> nil
 <span style="color: #036A07;">"Button for `</span><span style="color: #D0372D;">highlight-phone-numbers</span><span style="color: #036A07;">'"</span>)

(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">highlight-phone-numbers</span> ()
  <span style="color: #036A07;">"Make phone numbers of the following types clickable:</span>
<span style="color: #036A07;">  (xxx) xxx-xxxx</span>
<span style="color: #036A07;">  xxx.xxx.xxx</span>
<span style="color: #036A07;">  xxxxxxxxxx</span>
<span style="color: #036A07;">  xxx-xxx-xxxx"</span>
  (<span style="color: #0000FF;">interactive</span>)
  (<span style="color: #0000FF;">let</span> ((inhibit-read-only t))
    (<span style="color: #0000FF;">setq</span> highlight-phone-numbers
          (button-lock-set-button
           (<span style="color: #0000FF;">rx</span>
            <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">optional () around area code</span>
            (optional <span style="color: #008000;">"("</span>)
            (= 3 digit)
            (optional <span style="color: #008000;">")"</span>)
            <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">delimiters</span>
            (<span style="color: #0000FF;">or</span> (optional <span style="color: #008000;">"-"</span>)
                (optional <span style="color: #008000;">"."</span>)
                (optional <span style="color: #008000;">" "</span>))
            (= 3 digit)
            (<span style="color: #0000FF;">or</span> (optional <span style="color: #008000;">"-"</span>)
                (optional <span style="color: #008000;">"."</span>)
                (optional <span style="color: #008000;">" "</span>))
            (= 4 digit))
           (<span style="color: #0000FF;">lambda</span> ()
             (<span style="color: #0000FF;">interactive</span>)
             (cisco-call (get-surrounding-text-with-property 'phone-number)))
           <span style="color: #006FE0;">:face</span> '((<span style="color: #006FE0;">:background</span> <span style="color: #008000;">"Darkolivegreen2"</span>)
                   (<span style="color: #006FE0;">:underline</span> t))
           <span style="color: #006FE0;">:help-echo</span> <span style="color: #008000;">"click to call"</span>
           <span style="color: #006FE0;">:keyboard-binding</span> (kbd <span style="color: #008000;">"RET"</span>)
           <span style="color: #006FE0;">:additional-property</span> 'phone-number))))

(add-hook 'text-mode 'highlight-phone-numbers)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">highlight-phone-numbers</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Phone numbers in mu4e messages</h2>
<div class="outline-text-2" id="text-3">
<p>
For some reason, the button-lock package doesn't seem to work in mu4e message buffers, Maybe it is because . The highlight-regexp package does work though, so for these special buffers we use a new approach. We will just put text properties where we want them, and use those properties to make the text clickable.
</p>

<p>
The messages are in read-only buffers, but we can inhibit that so we can modify the properties. All we need to do is create a little key map as a copy of the existing map, define some keys on it, then search through the buffer adding properties to every phone number we find. I wrote a function that does that, and put that function in a hook to run each time I open a message. Whammo, now I have clickable phone numbers in email! It works pretty well for me.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defface</span> <span style="color: #BA36A5;">mu4e-phone-face</span>
  '((t (<span style="color: #006FE0;">:foreground</span> <span style="color: #008000;">"SteelBlue4"</span> <span style="color: #006FE0;">:background</span> <span style="color: #008000;">"Darkolivegreen2"</span> <span style="color: #006FE0;">:underline</span> t)))
  <span style="color: #036A07;">"Phone number directive face."</span>)

(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">mu4e-highlight-phone-numbers</span> ()
  <span style="color: #036A07;">"Make phone numbers clickable in mu4e-view buffers."</span>
  (<span style="color: #0000FF;">interactive</span>)
  (<span style="color: #0000FF;">let</span> ((phone-regex (<span style="color: #0000FF;">rx</span>
                      <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">optional () around area code</span>
                      (optional <span style="color: #008000;">"("</span>)
                      (= 3 digit)
                      (optional <span style="color: #008000;">")"</span>)
                      <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">delimiters</span>
                      (<span style="color: #0000FF;">or</span> (optional <span style="color: #008000;">"-"</span>)
                          (optional <span style="color: #008000;">"."</span>)
                          (optional <span style="color: #008000;">" "</span>))
                      (= 3 digit)
                      (<span style="color: #0000FF;">or</span> (optional <span style="color: #008000;">"-"</span>)
                          (optional <span style="color: #008000;">"."</span>)
                          (optional <span style="color: #008000;">" "</span>))
                      (= 4 digit))))
    (<span style="color: #0000FF;">save-excursion</span>
      (<span style="color: #0000FF;">let</span> ((inhibit-read-only t))
        (goto-char (point-min))
        (<span style="color: #0000FF;">while</span> (re-search-forward phone-regex nil t)
          (<span style="color: #0000FF;">let</span> ((map (copy-keymap mu4e-view-mode-map))
                (start (match-beginning 0))
                (end (match-end 0)))

            <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">set file to be clickable to open the source</span>
            (define-key map [mouse-1]
              `(<span style="color: #0000FF;">lambda</span> ()
                 (<span style="color: #0000FF;">interactive</span>)
                 (cisco-call ,(match-string 0))))

            <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">let letter c also make the call</span>
            (define-key map <span style="color: #008000;">"c"</span>
               `(<span style="color: #0000FF;">lambda</span> ()
                 (<span style="color: #0000FF;">interactive</span>)
                 (cisco-call ,(match-string 0))))

            (set-text-properties
             start end
             `(local-map, map
                          face mu4e-phone-face
                          mouse-face highlight
                          help-echo <span style="color: #008000;">"mouse-1: click to call"</span>))))))))

(add-hook 'mu4e-view-mode-hook 'mu4e-highlight-phone-numbers)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Summary</h2>
<div class="outline-text-2" id="text-4">
<p>
That works pretty well for me overall. The phone number regex is not perfect, e.g. it makes any 10 digit number clickable, and it doesn't recognize international numbers. I am not sure I can call those through the Jabber client anyway. This is purely convenience for me to easily make calls from emails, or other kinds of documents I might read in Emacs.
</p>

<p>
I don't use phone calls very often, but an interesting thing might be to open a phone log in org-mode, or open the contact that has that phone number to log that you called them, and provide some notes for them. Alternatively, open a new capture for a phone log that could be refiled later.
</p>
</div>
</div>
<p>Copyright (C) 2015 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2015/11/04/Clickable-telephone-numbers-in-mu4e-messages.org">org-mode source</a><p><p>Org-mode version = 8.2.10</p>